[
    {
        "id": 1,
        "name": "Ciberhead-500",
        "thumbnail": "product01.jpg",
        "description": "Transforma tu robot humanoide con el CyberHead X-500, una cabeza robótica de alta tecnología con sensores avanzados y un diseño futurista. Perfecta para personalización y mejoras de inteligencia, ¡haz que tu creación destaque con un estilo único y funcionalidad superior!",
        "price": 28000,
        "stock": 10,
        "promoted": true
    },
    {
        "id": 2,
        "name": "SmartBot Navigator",
        "thumbnail": "product02.jpg",
        "description": "Descubre el futuro con el SmartBot Navigator, un robot interactivo con pantalla táctil y diseño ergonómico. Perfecto para asistentes personales o exploración, ¡llevala tecnología a otro nivel con este compañero innovador!",
        "price": 15000,
        "stock": 15,
        "promoted": false
    },
    {
        "id": 3,
        "name": "RoboArm-200",
        "thumbnail": "product03.jpg",
        "description": "Potencia tu producción con el RoboArm Pro-200, un brazo robótico industrial de precisión con movimientos suaves y alta resistencia. Ideal para tareas complejas, ¡es la herramienta definitiva para optimizar tu taller robótico!",
        "price": 26000,
        "stock": 8,
        "promoted": false
    },
    {
        "id": 4,
        "name": "AgileBot Fighter",
        "thumbnail": "product04.jpg",
        "description": "Domina las competencias con el AgileBot Fighter, un robot de combate con articulaciones reforzadas y velocidad excepcional. ¡Equipado para victorias, este repuesto es esencial para tu próximo desafío robótico!",
        "price": 180000,
        "stock": 5,
        "promoted": false
    },
    {
        "id": 5,
        "name": "PrecisionArm X-100",
        "thumbnail": "product05.jpg",
        "description": "Mejora la precisión de tu robot con el PrecisionArm X-100, un brazo robótico de alta tecnología para tareas delicadas. ¡Perfecto para ensamblaje y laboratorio, un must para profesionales!",
        "price": 45000,
        "stock": 12,
        "promoted": true
    },
    {
        "id": 6,
        "name": "AssistBot Core",
        "thumbnail": "product06.jpg",
        "description": "Optimiza tu asistente robótico con el AssistBot Core, un módulo central con pantalla integrada y diseño compacto. ¡Ideal para tareas diarias, lleva la eficiencia a tu hogar o negocio!",
        "price": 12000,
        "stock": 20,
        "promoted": true
    },
    {
        "id": 7,
        "name": "GlobalReach Manipulator",
        "thumbnail": "product07.jpg",
        "description": "Amplía las posibilidades con el GlobalReach Manipulator, un brazo robótico con alcance extendido y diseño robusto. ¡Controla el mundo desde tu estación con esta pieza revolucionaria!",
        "price": 6000000000,
        "stock": 3,
        "promoted": false
    },
    {
        "id": 8,
        "name": "DeliveryBot Wheel Set",
        "thumbnail": "product08.jpg",
        "description": "Renueva tu robot de entrega con el DeliveryBot Wheel Set, un conjunto de ruedas duraderas y eficientes. ¡Garantiza entregas rápidas y confiables con este upgrade esencial!",
        "price": 15000,
        "stock": 25,
        "promoted": false
    },
    {
        "id": 9,
        "name": "FlexiBot Frame",
        "thumbnail": "product09.jpg",
        "description": "Construye o repara con el FlexiBot Frame, un chasis adaptable para robots humanoides. ¡Ligero, resistente y personalizable, es la base perfecta para tu próxima creación!",
        "price": 11000,
        "stock": 18,
        "promoted": false
    },
    {
        "id": 10,
        "name": "CleanBot Duo Kit",
        "thumbnail": "product10.jpg",
        "description": "Mantén todo impecable con el CleanBot Duo Kit, un conjunto de repuestos para robots de limpieza con herramientas versátiles. ¡Ahorra tiempo y esfuerzo con esta solución perfecta para hogares inteligentes!",
        "price": 12000,
        "stock": 30,
        "promoted": false
    },
    {
        "id": 11,
        "name": "VisionBot Sentinel",
        "thumbnail": "product11.jpg",
        "description": "Mejora la percepción de tu robot con el VisionBot Sentinel, equipado con ojos LED y sensores de alta definición. ¡Ideal para navegación y seguridad, este repuesto te ofrece control total en cualquier entorno!",
        "price": 2500,
        "stock": 22,
        "promoted": false
    },
    {
        "id": 12,
        "name": "MobilityBot X-700",
        "thumbnail": "product12.jpg",
        "description": "Revoluciona la movilidad con el MobilityBot X-700, un robot humanoide con ruedas avanzadas y panel de control integrado. ¡Perfecto para tareas de vigilancia o entrega, con un diseño robusto y versátil que no te decepcionará!",
        "price": 24000,
        "stock": 10,
        "promoted": false
    },
    {
        "id": 13,
        "name": "IndustroArm Elite",
        "thumbnail": "product13.jpg",
        "description": "Maximiza la productividad con el IndustroArm Elite, un brazo robótico de alta resistencia y precisión para industrias exigentes. ¡Con un agarre potente y diseño ergonómico, es la elección de los profesionales!",
        "price": 55000,
        "stock": 7,
        "promoted": false
    },
    {
        "id": 14,
        "name": "Auditron 4500",
        "thumbnail": "product14.jpg",
        "description": "Consigue las mejores revisiones de informes con el Auditron 4500, ideal para revisión contable y de variables de negocios.",
        "price": 35000,
        "stock": 8,
        "promoted": false
    },
    {
        "id": 15,
        "name": "Industrial Auditron IP69K",
        "thumbnail": "product15.jpg",
        "description": "Misma performance que el Auditron 4500 pero con conectividad mejorada y a prueba de agua, polvo y sustancias cáusticas.",
        "price": 18000,
        "stock": 20,
        "promoted": false
    },
    {
        "id": 16,
        "name": "Senior Care Companion Deluxe",
        "thumbnail": "product16.jpg",
        "description": "El compañero ideal para personas mayores, cocina más de 200 recetas respetando inhibiciones alimenticias especiales, capaz de hacer seguimiento a +40 abuelos y sus medicaciónes, comunicación remota aún sin señal de celulares con servicios médicos.",
        "price": 75000,
        "stock": 5,
        "promoted": false
    },
    {
        "id": 17,
        "name": "Auriga Suspirante",
        "thumbnail": "product17.jpg",
        "description": "El mejor robot para navegación hiperespacial, capaz de manejar más de 2500 variables de posicionamiento en naves con motor suspirante, motor de salto y motor de curvatura, actualizado con astrocartografía de via láctea y nubes mayor y menor de magallanes.",
        "price": 22000,
        "stock": 12,
        "promoted": true
    },
    {
        "id": 18,
        "name": "Otaku-borg",
        "thumbnail": "product18.jpg",
        "description": "Robot femenino japonés con capacidad de enseñar animé, japonés y cocina nipona.",
        "price": 40000,
        "stock": 9,
        "promoted": false
    },
    {
        "id": 19,
        "name": "Profe-pedia",
        "thumbnail": "product19.jpg",
        "description": "Robot docente de STEAM: Matemática, Física, Quimica, Biología, Astrofísica e Ingeniería Hiperespacial. Compendio de las bases de datos más actualizadas.",
        "price": 30000,
        "stock": 15,
        "promoted": false
    },
    {
        "id": 20,
        "name": "E-mily",
        "thumbnail": "product20.jpg",
        "description": "Robot de compañía para adultos.",
        "price": 32000,
        "stock": 10,
        "promoted": false
    }
]